{"id":505,"date":"2019-12-18T13:39:44","date_gmt":"2019-12-18T13:39:44","guid":{"rendered":"https:\/\/bella-disu.com\/?p=505"},"modified":"2019-12-18T13:39:44","modified_gmt":"2019-12-18T13:39:44","slug":"bella-disu-chevalier-dans-lordre-des-arts-et-des-lettres","status":"publish","type":"post","link":"https:\/\/bella-disu.com\/press-release\/bella-disu-chevalier-dans-lordre-des-arts-et-des-lettres\/","title":{"rendered":"Bella Disu, Chevalier Dans L’ordre Des Arts Et Des Lettres"},"content":{"rendered":"<p>France has honoured the Executive Vice Chairman of Globacom, Mrs Bella Disu with the prestigious national honour of “Chevalier dans l’ordre des Arts et des Lettres”.<\/p>\n<p style=\"text-align: center;\"><a ref=\"magnificPopup\" href=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?ssl=1\"><img data-attachment-id=\"502\" data-permalink=\"https:\/\/bella-disu.com\/bella\/attachment\/mrs-bella-disu_11-jpg\/\" data-orig-file=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?resize=800%2C1200&#038;ssl=1\" data-orig-size=\"800,1200\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;3.2&quot;,&quot;credit&quot;:&quot;Adetona Omokanye&quot;,&quot;camera&quot;:&quot;Canon EOS 5D Mark III&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1576262064&quot;,&quot;copyright&quot;:&quot;Adetona Omokanye&quot;,&quot;focal_length&quot;:&quot;115&quot;,&quot;iso&quot;:&quot;640&quot;,&quot;shutter_speed&quot;:&quot;0.008&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"Bella Disu\" data-image-description=\"\" data-medium-file=\"https:\/\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg-200x300.jpg\" data-large-file=\"https:\/\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg-683x1024.jpg\" loading=\"lazy\" class=\"alignnone size-full wp-image-502\" src=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?resize=800%2C1200&#038;ssl=1\" alt=\"\" width=\"800\" height=\"1200\" srcset=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?w=800&amp;ssl=1 800w, https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?resize=200%2C300&amp;ssl=1 200w, https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?resize=683%2C1024&amp;ssl=1 683w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p>The Award, which is in recognition of Mrs Disu&#8217;s remarkable support for arts and culture, especially her coordination of the construction of the iconic Alliance Francaise | Mike Adenuga Centre, Ikoyi, Lagos, was presented to her at a formal ceremony held at the Centre and presided over by the French State Secretary for Education and Youth, Minister Gabriel Attal.<\/p>\n<p>The French Minister, who is the youngest Minister in France, said he was delighted to present the honour to Mrs Bella Disu as the youngest recipient of the French national honour.<\/p>\n<p>The Minister said the unique national honour is reserved for icons who have supported the sustenance and growth of French culture.<\/p>\n<p>He described the Mike Adenuga Centre as magnificent and the most beautiful of all Alliance Francaise centres in the world. He also described the equipment, sound, lighting and technology at the Centre as first class, adding that the project is a cultural revolution.<\/p>\n<p>Facing the Chairman of Mike Adenuga Group, Dr. Mike Adenuga Jr who witnessed the ceremony along with the Lagos State Governor, Mr. Babajide Sanwo-Olu, the French Ambassador to Nigeria &amp; ECOWAS, Mr. Jérôme Pasquier and other eminent dignitaries, the French Minister said, &#8220;Who could have imagined that it was possible to build such a cultural centre in just a few months? From the very first minute, dear Chairman, you wished that your daughter would lead the project that would facilitate cultural collaborations between French speaking countries and Nigeria.<\/p>\n<p>&#8220;The team worked relentlessly under the attentive but firm supervision of Bella to deliver the building in a record time. It is one of the most exceptional projects of our cultural network and one of the most outstanding examples of arts and culture sponsorships in Nigeria.<\/p>\n<p>&#8220;We owe this exceptional project to you Chairman, who financed it, as much as to Bella who brought it to life,&#8221; he said.<\/p>\n<p>In a remark on the award, Charles Courdent, Director, Alliance Francaise, Lagos, said the Centre was proud of Mrs Bella Disu&#8217;s uncommon hardwork that gave birth to the Alliance Francaise | Mike Adenuga Centre, adding that &#8220;the vision of Globacom Chairman, Dr. Mike Adenuga has been fully accomplished by his daughter in this project.&#8221;<\/p>\n<p>In her acceptance speech, Mrs Disu expressed gratitude to President Emmanuel Macron of France for the honour. She also thanked her supportive husband, Mr. Jameel Disu, family, friends and all members of the Mike Adenuga Centre project team, particularly the Director who set an audacious vision for the Centre.<\/p>\n<p>&#8220;I am thankful for the firm belief that it could be done. Just look at where we are now. The centre has become such a reference point, a cultural hub, promoting French language and culture, showcasing Nigerian talent. We did it and I am proud of the entire project team. I applaud your expertise and tireless commitment&#8221;, she said.<\/p>\n<p>Narrating the hardwork and sleepless nights that birthed the project, Mrs Disu enthused, &#8220;Everyday I went to the site determined to fulfil the vision we had set with the Alliance Française team, I didn’t think anyone was watching. Yet, to be awarded the prestigious Chevalier dans l’ordre des Arts et des Lettres, en Anglais, Knight in the Order of Arts and Letters, has shown me that when you are dedicated and passionate, even when you think no one is watching, today will be the tomorrow you always dreamt of. It&#8217;s been a journey to this honour, but I have not come this far alone. I’d like to thank those who have made it easier for me to stand firm and stand strong on this stage. This award is as much for you. I’d like to thank my father, Dr. Mike Adenuga Jr GCON CSG CDR LH. Thank you, daddy, for your support and for the platform you have given me. Your magnanimity and heart for society continually inspires me…&#8221;.<\/p>\n<p>She described the award as a fulfilment of a dream she had in her sophomore year at the University, concluding that &#8220;today is the tomorrow&#8221;.<\/p>\n<p>Mrs Disu charged all to always do their best on tasks irrespective of whether it was noticed or not, so that their actions will speak for them in rooms where they are not present.<\/p>\n<p>&#8220;I assure you that someone is and one day, today will be the tomorrow you always dreamt of&#8221;, she said.<\/p>\n<p>A business leader who currently serves as Executive Vice Chairman of Globacom, CEO of Cobblestone Properties and Estates, Director at Abumet PLC and non-executive director with Julius Berger, Mrs Disu is a multi-instrumentalist, humanist, patriot and philanthropist. She started playing the Piano at the age of 4 and Saxophone at the age of 18.<\/p>\n<p>For years, she has been a distinctive benefactor of the Musical Society of Nigeria (MUSON) to encourage a better environment for musical learning.<\/p>\n<p>She holds a BA from the University of Massachusetts, Boston and an MSc from Northeastern University, Boston. Mrs Disu is a Member of the Nigerian Institute of Management (NIM) and the Institute of Directors (IoD).<\/p>\n<p>&nbsp;<\/p>\n<p>Mrs Bella Disu is happily married with children.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>France has honoured the Executive Vice Chairman of Globacom, Mrs Bella Disu with the prestigious national honour of “Chevalier dans l’ordre des Arts et des Lettres”. The Award, which is in recognition of Mrs Disu&#8217;s remarkable support for arts and culture, especially her coordination of the construction of the iconic Alliance Francaise | Mike Adenuga Centre,&#8230;<\/p>\n","protected":false},"author":1,"featured_media":502,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[1],"tags":[],"jetpack_featured_media_url":"https:\/\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg","jetpack_shortlink":"https:\/\/wp.me\/paLGCo-89","jetpack-related-posts":[{"id":544,"url":"https:\/\/bella-disu.com\/news\/iwd2020-bella-disu-amongst-select-women-celebrated-by-the-executive-governor-of-lagos-state-mr-babajide-sanwo-olu\/","url_meta":{"origin":505,"position":0},"title":"#IWD2020: Bella Disu Amongst Select Women Celebrated by the Executive Governor of Lagos State, Mr. Babajide Sanwo-Olu.","date":"March 12, 2020","format":false,"excerpt":"On March 8, 2020, the International Women’s Day (IWD), the world stood together to say ‘Each for Equal’, encouraging every person to work with others to create a “more equal world”. Beyond being a day of widespread advocacy for women’s rights, it was also one for acknowledging women blazing trails…","rel":"","context":"In &quot;News&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/05\/image1-13.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":450,"url":"https:\/\/bella-disu.com\/press-release\/paul-kagame-bella-disu-seek-collaboration-for-regional-integration-at-africa-ceo-forum\/","url_meta":{"origin":505,"position":1},"title":"Paul Kagame, Bella Disu seek collaboration for regional integration at Africa CEO Forum","date":"March 25, 2019","format":false,"excerpt":"Rwandan President, Paul Kagame and Globacom’s Executive Vice Chairman, Mrs Bella Disu, on Monday began discussions on the use of digital technology to help the march towards economic prosperity in Africa. The two leaders held a private meeting after the opening session of the two-day Africa CEO Forum taking place…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/03\/image1-6.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":531,"url":"https:\/\/bella-disu.com\/press-release\/glo-wins-brand-of-the-decade-as-adenuga-emerges-entrepreneur-of-the-decade-at-thisday-awards\/","url_meta":{"origin":505,"position":2},"title":"Glo wins Brand of the Decade, as Adenuga emerges Entrepreneur of the Decade at Thisday Awards.","date":"January 21, 2020","format":false,"excerpt":"Fresh from the euphoria of the Telecom Brand of the Year Award bestowed on Globacom recently by the World Branding Forum in Kensington Palace, London, Thisday Newspapers on Monday honoured the digital transformation company, Globacom, with the Brand of the Decade award as part of activities lined up to celebrate…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/03\/image1-10.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":446,"url":"https:\/\/bella-disu.com\/news\/bella-disu-bola-adesola-and-other-business-leaders-arrive-kigali-for-africa-ceo-forum\/","url_meta":{"origin":505,"position":3},"title":"Bella Disu, Bola Adesola and other business leaders arrive Kigali for Africa CEO Forum.","date":"March 25, 2019","format":false,"excerpt":"The Executive Vice Chairman of Globacom, Mrs Bella Disu, is among African business leaders who have arrived in Kigali, Rwanda, for the 2019 Africa CEO Forum which begins on Monday. Amadou Gon Coulibaly, Prime Minister of Côte d'Ivoire; Philippe Le Houerou of International Finance Corporation; Chairman of Seplat Petroleum, ABC Orjiako;…","rel":"","context":"In &quot;News&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/03\/image1-5-1.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":589,"url":"https:\/\/bella-disu.com\/press-release\/bella-disu-foundation-partners-with-regalo-hope-foundation-to-award-scholarships\/","url_meta":{"origin":505,"position":4},"title":"Bella Disu Foundation Partners With Regalo Hope Foundation To Award Scholarships","date":"October 30, 2020","format":false,"excerpt":"In September 2020, the Bella Disu Foundation partnered with Regalo Hope Foundation (RHF), to support the latter’s work in providing educational scholarships and helping underprivileged communities. The donation was made in line with the Bella Disu Foundation’s objective of improving the potential of children from underprivileged backgrounds by providing access…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/10\/image0.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":623,"url":"https:\/\/bella-disu.com\/press-release\/bella-disu-foundation-partners-with-international-womens-society-to-launch-the-newly-introduced-chess-program-with-chess-in-slums-africa\/","url_meta":{"origin":505,"position":5},"title":"Bella Disu Foundation Partners With International Women’s Society To Launch The Newly Introduced Chess Program With Chess In Slums Africa","date":"April 13, 2022","format":false,"excerpt":"The Bella Disu Foundation has partnered with The International Women’s Society to establish a chess academy at the IWS Skills Acquisition center, Lekki and Day Nursery School, Yaba.  To support the organization in providing empowerment and educational opportunities to women and children, Mrs Bella Disu made a donation on behalf…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"BDF x IWS x CIS","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2022\/04\/0D0E91D6-A83B-4AE3-8E65-3284424AE4C9-scaled.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/505"}],"collection":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/comments?post=505"}],"version-history":[{"count":1,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/505\/revisions"}],"predecessor-version":[{"id":507,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/505\/revisions\/507"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/media\/502"}],"wp:attachment":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/media?parent=505"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/categories?post=505"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/tags?post=505"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}