{"id":537,"date":"2020-03-06T15:43:06","date_gmt":"2020-03-06T15:43:06","guid":{"rendered":"https:\/\/bella-disu.com\/?p=537"},"modified":"2020-04-07T15:47:28","modified_gmt":"2020-04-07T15:47:28","slug":"evonig-glass-a-premium-double-glazed-glass-line","status":"publish","type":"post","link":"https:\/\/bella-disu.com\/press-release\/evonig-glass-a-premium-double-glazed-glass-line\/","title":{"rendered":"EVONIG GLASS, a premium double-glazed glass line."},"content":{"rendered":"<p>Nigeria’s leading, most resilient and reliable engineering construction company, Julius Berger Nigeria Plc has officially launched its new innovative product, the Evonig Glass in Abuja.<\/p>\n<p>Combined with the launch is the commissioning of the state-of-the-art IGU production line at which event guests and specially invited industry and other corporate players had an opportunity to have a first-hand look at some of the latest industrial production facilities and processes at the Abumet factory at Idu industrial area, Abuja.<\/p>\n<p><a ref=\"magnificPopup\" href=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?ssl=1\"><img data-attachment-id=\"538\" data-permalink=\"https:\/\/bella-disu.com\/press-release\/evonig-glass-a-premium-double-glazed-glass-line\/attachment\/image1-11\/\" data-orig-file=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?resize=968%2C650&#038;ssl=1\" data-orig-size=\"968,650\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;5&quot;,&quot;credit&quot;:&quot;Adetona Omokanye&quot;,&quot;camera&quot;:&quot;Canon EOS 5D Mark III&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1583426006&quot;,&quot;copyright&quot;:&quot;Adetona Omokanye&quot;,&quot;focal_length&quot;:&quot;24&quot;,&quot;iso&quot;:&quot;250&quot;,&quot;shutter_speed&quot;:&quot;0.004&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"EVONIG GLASS, a premium double-glazed glass line.\" data-image-description=\"\" data-medium-file=\"https:\/\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11-300x201.jpeg\" data-large-file=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?resize=968%2C650&#038;ssl=1\" loading=\"lazy\" class=\"alignnone size-full wp-image-538\" src=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?resize=968%2C650&#038;ssl=1\" alt=\"\" width=\"968\" height=\"650\" srcset=\"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?w=968&amp;ssl=1 968w, https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg?resize=300%2C201&amp;ssl=1 300w\" sizes=\"(max-width: 968px) 100vw, 968px\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p>Giving his address at the event, the General Manager of Abumet, the top grade metal and glass subsidiary of Julius Berger Nigeria Plc, Mr Tamas Hovart defined Evonig Glass as an industrial acronym which proudly synthesises the two words ‘Evolution’ and ‘Nigeria’.<\/p>\n<p>The product, Tamas said, “is not just an improvement of existing offerings in the Nigerian market; it is a combination of the latest technology and a skilled and committed Nigeria team.”<\/p>\n<p>The Evonig Glass, Tamas further explained, “is a special offering defined by great production quality according to best international standard, innovation, availability, local content and a strong Nigerian workforce, reliable technical partnerships and advanced technology as well as sustainability and reliable after-sales service.”<\/p>\n<p>The General Manager of Abumet, Tamas informed guests at the event that current industrial and procurement estimates of supply to the Nigerian IGU market is put at 90% for imported production and 10% for local production.<\/p>\n<p>This situation, he said, exposes the Nigerian users of the product to a long wait for offshore shipments and prohibitive exposure to foreign exchange challenges. Julius Berger Abumet, Tamas said, “aims to offer comparably faster delivery times for a high quality insulated glass unit solution made in Nigeria with international standards, at a competitive rate.”<\/p>\n<p>The Julius Berger Abumet Evonig glass, offer technical solutions more commonly known as Double glazing, a well-known application in Sub-tropical areas, which consists of two glass panel separated by a vacuum or gas-filled space to reduce heat transfer and noise across a part of the building; and Triple glazing which consists of three-glass panel and two space to achieve greater performance level.<\/p>\n<p>This glazing technology now manufactured in Nigeria by Julius Berger Abumet is highly recommended where the temperature difference between interior and outside spaces is significant so that greater thermal insulation required.<\/p>\n<p>Tamas confidently spoke of the key benefits of using Insulated glass units to include energy savings by which “the insulated glass windows prevent heat loss when it is cold and sustains the cool air when it is hot” This, the Abumet General Manager said, reduces power consumption in a building and saves cost.<\/p>\n<p>The use of Evonig glass with its two glass panes and vacuum space also limits and significantly reduces noise from passing through the building. Tamas happily adds that “it becomes even better when the two panes of glass have various thickness”.<\/p>\n<p>Another key benefit of Evonig glass is that it technically increases the important function of security in a building. With more glass panes, IGU panels become tougher and with a combination of laminated or toughened glass types its get more difficult to break.<\/p>\n<p>The Honourable Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, CON was at the event to commission the Julius Berger Abumet Evonig Glass production plant.<\/p>\n<p>The Honourable Minister commended the Julius Berger Group for its initiative to domesticate the novel production of Evonig Glass at the Idu Industrial Area in Abuja Nigeria.<\/p>\n<p>Adebayo who said the President Buhari administration has the vision to create a hundred million jobs in the country in the next decade described the Abumet plant as a worthy job creation initiative. The Honourable Minister gave kudos to Julius Berger for also pioneering the first and most advance fully automated IGU production line in Nigeria.<\/p>\n<p>The Hon. Minister described the Abumet production plant as revolutionary to Nigeria’s industrial development. “Keep up your worthy contributions to our strategic national industrial development and growth works”, Otunba Adebayo encouraged Julius Berger.<\/p>\n<p>The alternate Chairman of Abumet, Mr Mahmud Tukur thanked the guests, especially the Honourable Minister, Otunba Adebayo, for finding time to attend the launch of the product and the commissioning of the production plant.<\/p>\n<p>In the excited words of Mahmud Tukur, “Abumet is ready to offer the Nigerian market the greatest deals in terms of best international quality as well as at the most cost-efficient rates. We await the orders of the very discerning Nigerian investors and clientele.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nigeria’s leading, most resilient and reliable engineering construction company, Julius Berger Nigeria Plc has officially launched its new innovative product, the Evonig Glass in Abuja. Combined with the launch is the commissioning of the state-of-the-art IGU production line at which event guests and specially invited industry and other corporate players had an opportunity to have&#8230;<\/p>\n","protected":false},"author":1,"featured_media":538,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[1],"tags":[],"jetpack_featured_media_url":"https:\/\/bella-disu.com\/wp-content\/uploads\/2020\/04\/image1-11.jpeg","jetpack_shortlink":"https:\/\/wp.me\/paLGCo-8F","jetpack-related-posts":[{"id":675,"url":"https:\/\/bella-disu.com\/news\/bella-disu-ranks-in-choiseul-100-africa-list-for-2022\/","url_meta":{"origin":537,"position":0},"title":"Bella Disu Ranks In Choiseul 100 Africa List for 2022","date":"October 24, 2022","format":false,"excerpt":"Executive Vice Chairman of Globacom, Bella Disu, has been named by Institut Choiseul, a Paris-based organization dedicated to the analysis of contemporary strategic issues and international economic questions, as one of the Choiseul 100 Africa Laureates for 2022. Choiseul 100 Africa is an annual study conducted independently by the Institut…","rel":"","context":"In &quot;News&quot;","img":{"alt_text":"Choiseul 100 Africa 2022","src":"https:\/\/i2.wp.com\/bella-disu.com\/wp-content\/uploads\/2022\/10\/IMG_9886.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":652,"url":"https:\/\/bella-disu.com\/news\/52nd-agm-julius-berger-nigeria-plc-delivers-progressively-highest-dividend-in-five-years-to-loyal-shareholders\/","url_meta":{"origin":537,"position":1},"title":"52nd AGM: Julius Berger Nigeria Plc Delivers Progressively Highest Dividend in Five Years to Loyal Shareholders","date":"June 29, 2022","format":false,"excerpt":"At the recently concluded 52nd Annual General Meeting of Julius Berger Nigeria Plc, the Chairman of the board, Mr Mutiu Sunmonu, CON, who presented the Consolidated Financial Statements of the year under review, disclosed that the company performed positively and is extending a N2.50k per share dividend to shareholders, after…","rel":"","context":"In &quot;News&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2022\/06\/IMG_1219-scaled.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":505,"url":"https:\/\/bella-disu.com\/press-release\/bella-disu-chevalier-dans-lordre-des-arts-et-des-lettres\/","url_meta":{"origin":537,"position":2},"title":"Bella Disu, Chevalier Dans L’ordre Des Arts Et Des Lettres","date":"December 18, 2019","format":false,"excerpt":"France has honoured the Executive Vice Chairman of Globacom, Mrs Bella Disu with the prestigious national honour of “Chevalier dans l’ordre des Arts et des Lettres”. The Award, which is in recognition of Mrs Disu's remarkable support for arts and culture, especially her coordination of the construction of the iconic Alliance…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/12\/Mrs-bella-Disu_11.jpg.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":400,"url":"https:\/\/bella-disu.com\/news\/bella-disu-65-others-get-institute-of-directors-certification\/","url_meta":{"origin":537,"position":3},"title":"Bella Disu, 65 others get Institute of Directors certification","date":"March 2, 2019","format":false,"excerpt":"Globacom’s Executive Vice Chairman, Mrs Bella Disu, and 65 other Directors have been certified by the Institute of Directors at the February 2019 New Members Induction ceremony of the Institute held at Eko Hotels on Thursday. Mrs Disu was among those who bagged the Institute’s full membership, some others got…","rel":"","context":"In &quot;News&quot;","img":{"alt_text":"","src":"https:\/\/i1.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/03\/image1-3.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":531,"url":"https:\/\/bella-disu.com\/press-release\/glo-wins-brand-of-the-decade-as-adenuga-emerges-entrepreneur-of-the-decade-at-thisday-awards\/","url_meta":{"origin":537,"position":4},"title":"Glo wins Brand of the Decade, as Adenuga emerges Entrepreneur of the Decade at Thisday Awards.","date":"January 21, 2020","format":false,"excerpt":"Fresh from the euphoria of the Telecom Brand of the Year Award bestowed on Globacom recently by the World Branding Forum in Kensington Palace, London, Thisday Newspapers on Monday honoured the digital transformation company, Globacom, with the Brand of the Decade award as part of activities lined up to celebrate…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/bella-disu.com\/wp-content\/uploads\/2020\/03\/image1-10.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":492,"url":"https:\/\/bella-disu.com\/press-release\/cobblestone-redefines-luxury-living-launches-sisi-paris-in-lagos\/","url_meta":{"origin":537,"position":5},"title":"Cobblestone Redefines Luxury Living, Launches Sisi Paris In Lagos","date":"November 5, 2019","format":false,"excerpt":"Prime property developers, Cobblestone Properties and Estates Limited, on Thursday hosted an evening of panache with friends and top-end clients to mark the birth of  Sisi Paris, the latest beauty on the skyline of highbrow Ikoyi in Lagos The event which was complemented by a jazz band, serenading the august…","rel":"","context":"In &quot;Press Release&quot;","img":{"alt_text":"","src":"https:\/\/i2.wp.com\/bella-disu.com\/wp-content\/uploads\/2019\/11\/image1-9-1.jpeg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/537"}],"collection":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/comments?post=537"}],"version-history":[{"count":1,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/537\/revisions"}],"predecessor-version":[{"id":539,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/posts\/537\/revisions\/539"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/media\/538"}],"wp:attachment":[{"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/media?parent=537"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/categories?post=537"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/bella-disu.com\/wp-json\/wp\/v2\/tags?post=537"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}